library/ABCD/SoapEnvelope.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
                   xmlns:ns1="http://schemas.calgary.ca/xsd/familycommunitysurveycdm/2012/08" 
                   xmlns:ns2="http://schemas.calgary.ca/xsd/familycommunitysurvey/2012/08" 
                   xmlns:ns3="http://coc.gov/xsd/ESB/SupplementalData/V1">
   <SOAP-ENV:Header>
      <ns3:SupplementalData>
         <ns3:SourceName>ABCD</ns3:SourceName>
         <ns3:ServiceProvider>
            <ns3:Name>FamilyCommunitySurvey</ns3:Name>
            <ns3:OperationName>SubmitSurvey</ns3:OperationName>
         </ns3:ServiceProvider>
         <ns3:CorrelationID>1354518493</ns3:CorrelationID>
      </ns3:SupplementalData>
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <ns2:SubmitSurveyRequest>
         <ns1:FamilyCommunitySurvey>
            <ns1:SubmissionCode>1354518493</ns1:SubmissionCode>
            <ns1:SubmissionDate>2012-12-03</ns1:SubmissionDate>
            <ns1:ProgramDetails>
               <ns1:ProgramCode>0195</ns1:ProgramCode>
               <ns1:OtherProgramName></ns1:OtherProgramName>
               <ns1:AgencyCode>024</ns1:AgencyCode>
               <ns1:ClientID>5759368086df7e3e6a5b17b4359f964c</ns1:ClientID>
               <ns1:ClientIDEstimated>0</ns1:ClientIDEstimated>
               <ns1:CodeBookVersion>2012/09/13</ns1:CodeBookVersion>
               <ns1:SurveyType>NULL</ns1:SurveyType>
               <ns1:ProgramDate>
                  <ns1:RegistrationDate>2012-12-01</ns1:RegistrationDate>
               </ns1:ProgramDate>
               <ns1:Surveys>
                  <ns1:Survey>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>gender</ns1:QuestionCode>
                        <ns1:Answer>1</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>grade</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>aborid</ns1:QuestionCode>
                        <ns1:Answer>77</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>popgrp</ns1:QuestionCode>
                        <ns1:Answer>11</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>popgrpoth</ns1:QuestionCode>
                        <ns1:Answer>Brazilian</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>homelang</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>langoth</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>borncan</ns1:QuestionCode>
                        <ns1:Answer>1</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>country</ns1:QuestionCode>
                        <ns1:Answer>Brazil</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>yrscan</ns1:QuestionCode>
                        <ns1:Answer>3</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>neighb</ns1:QuestionCode>
                        <ns1:Answer>Whitehorn</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>referby</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>marital</ns1:QuestionCode>
                        <ns1:Answer>3</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>adults</ns1:QuestionCode>
                        <ns1:Answer>1</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>numchild</ns1:QuestionCode>
                        <ns1:Answer>0</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>child1age</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>child2age</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>child3age</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>child4age</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>child5age</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>child6age</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>child7age</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>child8age</ns1:QuestionCode>
                        <ns1:Answer>99</ns1:Answer>
                     </ns1:Questionnaire>
                     <ns1:Questionnaire>
                        <ns1:QuestionCode>age</ns1:QuestionCode>
                        <ns1:Answer>58</ns1:Answer>
                     </ns1:Questionnaire>
                  </ns1:Survey>
                  <ns1:Code>001</ns1:Code>
               </ns1:Surveys>
            </ns1:ProgramDetails>
         </ns1:FamilyCommunitySurvey>
      </ns2:SubmitSurveyRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
\